{
  "backend/main.mo": "Main Motoko actor that combines blob storage and authorization mixins to expose user profile management, announcements (admin-only write, public read), and contact inquiry (public submit, admin-only read) endpoints.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: fixing the photo lightbox in GallerySection and appending 'Maharajganj Jainpur' to the committee name across Header, Footer, HeroSection, and index.html.",
  "frontend-file-summaries.txt": "Auto-generated text file containing 1–2 sentence summaries of every frontend source file, serving as a quick reference for the project's component and hook inventory.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML shell for the React app with the page title and meta description set to include the full committee name 'मस्जिद ए गौसिया वेलफेयर कमेटी महराजगंज जैनपुर'.",
  "frontend/src/App.tsx": "Root React component that composes all page sections in order (Hero, About, Services, Announcements, Gallery, Donate, Contact) with GeometricDividers between them and conditionally renders the ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/AboutSection.tsx": "About section displaying four value cards and a mission panel with a Quranic quote; stat counters in the mission panel are all set to zero.",
  "frontend/src/components/AnnouncementsSection.tsx": "Announcements section that fetches backend data via React Query and renders loading, error, empty, and populated grid states with Hindi-formatted dates.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with mosque address/phone/email/hours info cards and a validated inquiry form that submits via the useSubmitInquiry hook.",
  "frontend/src/components/DecorativePattern.tsx": "Simple presentational component that overlays a geometric pattern image as an absolutely-positioned, non-interactive background decoration with configurable opacity.",
  "frontend/src/components/DonateSection.tsx": "Displays a donation section with copyable bank transfer details, impact statistics, and a Quranic quote, using DecorativePattern for background styling.",
  "frontend/src/components/Footer.tsx": "Site footer with logo/branding, smooth-scroll navigation links, contact details, copyright, and a caffeine.ai attribution badge.",
  "frontend/src/components/GallerySection.tsx": "Photo gallery section displaying a 2026 annual event album in a grid with a keyboard-accessible lightbox supporting prev/next navigation and Escape to close.",
  "frontend/src/components/GeometricDivider.tsx": "Thin presentational component that renders a full-width decorative section-divider image, capped at 80px height.",
  "frontend/src/components/Header.tsx": "Fixed site header with logo, desktop nav links, a donate button, a LoginButton, and a responsive mobile hamburger menu; applies a blur/shadow effect on scroll.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section for the Masjid-e-Gausia Welfare Committee site, displaying a mosque background image, Bismillah text, logo, Hindi headings, and CTA buttons for donation and about navigation with smooth scrolling.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout, showing loading state with a spinner and clearing React Query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name and saves it via the saveCallerUserProfile mutation; cannot be dismissed without submitting.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of six welfare services (education, medical, housing, food, literacy, widow support) offered by the committee, each with an icon, title, and description.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, using an authenticated identity when available or an anonymous actor otherwise, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthQueries.ts": "Provides React Query hooks for fetching and saving the caller's user profile, user role, and admin status via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching announcements (sorted by date) and submitting contact inquiries via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Devanagari fonts, sets up Tailwind directives, defines a warm ivory/champagne/orange color palette via CSS custom properties, and provides reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a custom color palette (ivory, champagne, orange, gold, forest), Devanagari/Arabic font families, custom shadows, and accordion/fade-in animations.",
  "project_state.json": "Project state metadata describing the Masjid-e-Gausia Welfare Committee gallery app, tracking two pending fix requests: repairing the photo lightbox in the Saalana Jalsa 2026 section and appending 'Maharajganj Jainpur' to the committee name across all components."
}