{
  "backend/main.mo": "Motoko actor defining the backend canister with CRUD operations for announcements and contact inquiries, including input validation and timestamp recording.",
  "feature_evidence.json": "Feature evidence report mapping the organization name/location update feature to the specific frontend files it affects and the test IDs that verify it.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and Hindi-language content.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark themes with neutral color tokens.",
  "frontend/index.html": "HTML entry point with lang set to 'hi' and page title set to 'मस्जिद ए गौसिया वेलफेयर कमिटी', loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles the single-page layout by composing Header, HeroSection, AboutSection, ServicesSection, AnnouncementsSection, DonateSection, and ContactSection.",
  "frontend/src/components/AboutSection.tsx": "About Us section displaying the organization's mission, values (करुणा, भाईचारा, शिक्षा, ईमानदारी), and a Hadith quote, all in Hindi with the full organization name and location.",
  "frontend/src/components/AnnouncementsSection.tsx": "Announcements section that fetches and displays announcement cards with Hindi UI text, loading/error/empty states, and date formatting using the hi-IN locale.",
  "frontend/src/components/ContactSection.tsx": "Contact section with a contact info panel showing the full Hindi address and a form for submitting inquiries with client-side validation and mutation state handling.",
  "frontend/src/components/DonateSection.tsx": "Renders a donation section with impact amounts, bank transfer details, and a contact scroll button, styled with an Islamic geometric background pattern.",
  "frontend/src/components/GeometricDivider.tsx": "A simple presentational component that renders a decorative geometric divider image as a full-width section separator.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop nav links, and a mobile hamburger menu that smooth-scrolls to page sections.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a mosque background image, Hindi tagline, and two CTA buttons that scroll to the About and Donate sections.",
  "frontend/src/components/ServicesSection.tsx": "Displays a 3-column grid of six welfare service cards (education, food, medical, etc.) with icons and descriptions, followed by a geometric divider.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching announcements (sorted by date) and submitting contact inquiries via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Cormorant Garamond, Inter), sets up Tailwind directives, and defines an Islamic-themed design system with CSS custom properties for colors (deep green, gold, cream) in both light and dark modes, plus reusable component classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Islamic-themed custom colors (forest, gold, cream), custom font families (Playfair Display, Cormorant Garamond, Inter), oklch-based CSS variable color mappings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file describing a Hindi-language welfare committee website for Masjid-e-Gausia Welfare Committee, Maharajganj, Jaunpur, tracking existing features and versioning at schema v1.0.0."
}