{
  "backend/main.mo": "Motoko actor defining the backend canister with CRUD operations for announcements and contact inquiries, including validation and timestamping.",
  "feature_evidence.json": "Feature evidence report mapping the dhani color scheme update feature to the affected frontend files (index.css and tailwind.config.js).",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and key content.",
  "frontend/index.css": "Base Tailwind CSS file defining shadcn-compatible CSS custom properties for light and dark themes using oklch color values.",
  "frontend/index.html": "HTML entry point with lang set to Hindi and page title set to the organization name in Hindi, loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles the single-page layout by composing all section components (Header, Hero, About, Services, Announcements, Donate, Contact).",
  "frontend/src/components/AboutSection.tsx": "About Us section component displaying organization description, core values (compassion, brotherhood, education, integrity), and an Islamic quote, all in Hindi.",
  "frontend/src/components/AnnouncementsSection.tsx": "Announcements section that fetches and displays announcement cards with Hindi UI text, handling loading, error, and empty states with Hindi locale date formatting.",
  "frontend/src/components/ContactSection.tsx": "Contact section with a contact info panel and a form for submitting inquiries, with Hindi labels, client-side validation, and mutation state handling.",
  "frontend/src/components/DonateSection.tsx": "Renders a donation section with impact amounts, bank transfer details, and a contact scroll button, styled with an Islamic geometric background pattern.",
  "frontend/src/components/GeometricDivider.tsx": "A simple presentational component that renders a decorative geometric divider image as a full-width separator.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop nav links, and a mobile hamburger menu that smooth-scrolls to page sections.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a mosque background image, Hindi tagline, and two CTA buttons that scroll to the About and Donate sections.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of six welfare service cards (education, food, medical, etc.) with icons and descriptions, followed by a geometric divider.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching announcements (sorted by date) and submitting contact inquiries via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that defines a Dhani (earthy olive-green) themed design system using OKLCH CSS custom properties for light/dark modes, imports Google Fonts (Playfair Display, Cormorant Garamond, Inter), and declares reusable component utility classes like section-title, gold-divider, and islamic-pattern-bg.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider (React Query) and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens (forest, gold, cream), custom font families (Playfair Display, Cormorant Garamond, Inter), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking the Masjid-e-Gausia Welfare site's current features and pending feature requests, specifically recording the completed and in-progress work to apply a Dhani dark green color scheme throughout the site."
}