{
  "backend/main.mo": "Main Motoko actor for the backend that includes blob storage and authorization mixins, and implements CRUD operations for user profiles, announcements, Juma collections, and contact inquiries with role-based access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and recent changes.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app with Hindi language attribute, page title and meta description referencing Masjid-e-Ghousia Welfare Committee in Jaunpur.",
  "frontend/src/App.tsx": "Root React component that composes all page sections in order, manages admin panel open state, conditionally renders ProfileSetupModal for new users, and wraps everything in a React Query provider.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying four value cards and a mission panel with an Islamic quote; stat counters in the mission panel are all set to zero.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel overlay component with tabbed interface for managing announcements, Juma collections, and contact inquiries, including add/delete forms with feedback messages and formatted date/currency display.",
  "frontend/src/components/AnnouncementsSection.tsx": "Displays a grid of announcements fetched via `useGetAnnouncements`, with loading, error, and empty states, formatting dates in Hindi locale.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with static contact info cards and a validated inquiry form that submits via `useSubmitInquiry`, showing success/error feedback.",
  "frontend/src/components/DecorativePattern.tsx": "A simple presentational component that renders a full-cover geometric pattern image with configurable opacity as an absolutely-positioned overlay.",
  "frontend/src/components/DonateSection.tsx": "Shows a donation section with copyable bank transfer details and placeholder impact statistics, using a decorative background pattern.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, smooth-scroll navigation links, contact details, copyright, and a caffeine.ai attribution badge.",
  "frontend/src/components/GallerySection.tsx": "Displays a photo gallery grid for 'Salana Jalsa 2026' with a keyboard-navigable lightbox supporting prev/next and Escape controls.",
  "frontend/src/components/GeometricDivider.tsx": "A simple presentational component that renders a full-width decorative section-divider image with a max height of 80px.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, Hindi nav links, smooth scroll, login button, and a conditional admin panel button shown only to authenticated admins.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with mosque background image, Bismillah text, committee logo, Hindi tagline, and smooth-scroll CTA buttons.",
  "frontend/src/components/JamaCollectionSection.tsx": "Displays Juma (Friday) donation collection records fetched from the backend, with a total amount banner and loading/error/empty states.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout, clears the React Query cache on logout, and shows a loading spinner during login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves the profile via the saveCallerUserProfile mutation.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of nine welfare services (education, medical, housing, etc.) offered by the committee, each with an icon, title, and description in Hindi.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuthQueries.ts": "React Query hooks for fetching and mutating the caller's user profile, role, and admin status via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on announcements, Juma collections, and contact inquiries via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Devanagari/Arabic fonts, defines a warm ivory/orange/gold color palette via CSS custom properties, and provides reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a custom color palette (ivory, champagne, orange, gold, forest), Devanagari/Arabic font families, custom shadows, and accordion/fade-in animations.",
  "project_state.json": "Tracks project state and pending feature requests, noting that an admin panel link needs to be added to the hamburger menu for authenticated admin users in the Header component."
}