{
  "backend/main.mo": "Main actor for the ICP backend implementing user profiles, announcements, Jama collections, and contact inquiries with role-based access control (admin/user) and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old Announcement records (without id) to new format (with id=0) for schema upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Jama Collection nav, section, admin panel, React Query hooks) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component's purpose, styling, and key behaviors.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point setting the page title and meta description in Hindi for the Masjid-e-Gausia Welfare Committee site.",
  "frontend/src/App.tsx": "Root React component that composes all page sections in order (including JamaCollectionSection), manages admin panel open state, and provides the React Query client context.",
  "frontend/src/components/AboutSection.tsx": "About section displaying four value cards and a mission panel with a Quranic quote; all stat counters are set to zero.",
  "frontend/src/components/AdminPanel.tsx": "A tabbed admin panel component for managing announcements, Jama collections, and contact inquiries, with add/delete functionality and Hindi UI text.",
  "frontend/src/components/AnnouncementsSection.tsx": "Displays a public-facing grid of committee announcements fetched via React Query, with loading, error, and empty states, all in Hindi.",
  "frontend/src/components/ContactSection.tsx": "A contact section with static contact info cards and a validated inquiry submission form that calls the useSubmitInquiry mutation.",
  "frontend/src/components/DecorativePattern.tsx": "A simple presentational component that renders a full-cover geometric pattern image as an absolutely-positioned decorative overlay with configurable opacity.",
  "frontend/src/components/DonateSection.tsx": "Displays bank transfer details with copy-to-clipboard functionality and impact statistics to encourage donations, with an Islamic quote for context.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, smooth-scroll navigation links, contact info, copyright, and a caffeine.ai attribution badge.",
  "frontend/src/components/GallerySection.tsx": "Renders a photo gallery section with a 4-photo grid for 'सालाना जलसा 2026', supporting a lightbox with keyboard navigation (arrow keys and Escape) for browsing images.",
  "frontend/src/components/GeometricDivider.tsx": "A simple presentational component that renders a full-width decorative section divider image with a max height of 80px.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with smooth-scroll nav links, a mobile hamburger menu, login/logout button, donate button, and a conditional admin panel button shown only to authenticated admins.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a mosque background image, committee logo, Hindi/Arabic text, and buttons to scroll to the about section.",
  "frontend/src/components/JamaCollectionSection.tsx": "Displays a transparent financial record of collected donations fetched via React Query, showing a total amount banner and handling loading, error, and empty states.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles Internet Identity login/logout, clears the React Query cache on logout, and shows a loading spinner during the login process.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name, then saves the profile via a mutation hook; it cannot be dismissed until the profile is saved.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of nine social service cards (education, medical, housing, food, etc.) with Hindi descriptions, icons, and color-coded styling for a community organization website.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthQueries.ts": "Provides React Query hooks for fetching and mutating the caller's user profile and role, including admin status checks, all dependent on the actor from useActor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on announcements, Jama collections, and contact inquiries, all delegating to the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Devanagari fonts, defines CSS custom properties for a warm ivory/champagne/orange color palette, and declares reusable component utility classes via Tailwind layers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom color palette (ivory, champagne, orange, gold, forest), typography, border radius, shadows, and animations for the frontend.",
  "project_state.json": "Project state tracking file recording existing features (Jama Collection section, admin panel, React Query hooks) and pending feature requests for a Hindi-language web app with an ICP backend."
}