{
  "backend/main.mo": "Main Motoko actor that composes blob storage and authorization mixins, and exposes endpoints for user profiles, announcements (admin-only write), and contact inquiries (admin-only read).",
  "feature_evidence.json": "Feature evidence report confirming that the stat counter for 'समाज की सेवा में समर्पित' in AboutSection has been set to 0, with high confidence and a reference to REQ-1.",
  "frontend-file-summaries.txt": "Auto-generated JSON file containing one-sentence summaries of every frontend source file, used as a build/documentation reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point with Hindi language attribute, committee logo favicon, SEO meta description, and the React app mount point.",
  "frontend/src/App.tsx": "Root React component that sets up React Query, composes all page sections with geometric dividers, and conditionally renders the ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/AboutSection.tsx": "About section displaying four value cards and a mission panel with stat counters (परिवारों की मदद, छात्रवृत्तियां, etc.) all currently set to 0.",
  "frontend/src/components/AnnouncementsSection.tsx": "Announcements section that fetches data via React Query and renders loading, error, empty, and populated grid states with Hindi-formatted dates.",
  "frontend/src/components/ContactSection.tsx": "A contact section component with mosque address/phone/email/hours info cards and a validated inquiry form that submits via the useSubmitInquiry hook, displaying success or error states in Hindi.",
  "frontend/src/components/DecorativePattern.tsx": "A simple presentational component that renders a full-cover geometric pattern image as an absolutely positioned, non-interactive overlay with configurable opacity.",
  "frontend/src/components/DonateSection.tsx": "A donation section displaying bank transfer details with copy-to-clipboard functionality and impact statistics, alongside a Quranic quote, built for the Masjid-e-Gausia welfare committee.",
  "frontend/src/components/Footer.tsx": "A site footer with the mosque logo/branding, quick navigation links with smooth scroll, contact details, copyright, and a caffeine.ai attribution badge.",
  "frontend/src/components/GeometricDivider.tsx": "A simple presentational component that renders a full-width section divider image with a max height of 80px.",
  "frontend/src/components/Header.tsx": "A fixed, scroll-aware header with the mosque logo, desktop navigation links, a donate button, a login button, and a collapsible mobile menu.",
  "frontend/src/components/HeroSection.tsx": "A full-screen hero section with a mosque background image, Bismillah text, logo, Hindi headline, and CTA buttons for donating and learning more, plus an animated scroll indicator.",
  "frontend/src/components/LoginButton.tsx": "An authentication button that uses Internet Identity to log in or out, clearing the React Query cache on logout and handling the already-authenticated edge case.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name and saves it via the `useSaveCallerUserProfile` mutation. Prevents dismissal until the profile is successfully saved.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of six welfare service cards (education, medical, housing, food, etc.) for the Masjid-e-Gausia Welfare Committee landing page section.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity or anonymously, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuthQueries.ts": "Provides React Query hooks for fetching and saving the caller's user profile and role, as well as checking admin status, all via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using `@dfinity/auth-client`, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching announcements (sorted by date) and submitting contact inquiries via the backend actor.",
  "frontend/src/index.css": "Defines global CSS custom properties for the app's color palette, imports Devanagari fonts, and declares Tailwind-based utility component classes like buttons, nav links, and dividers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom color palette (ivory, champagne, orange, gold, forest, near-black), semantic shadcn tokens, multilingual font families, and custom animations/shadows.",
  "project_state.json": "Project state metadata for the Masjid-e-Gausia Welfare app, tracking schema version, existing features, and configuration flags for the build planner."
}