{
  "backend/main.mo": "Main Motoko actor that combines blob storage and authorization mixins to expose user profile management, announcements (admin-only write, public read), and contact inquiry (public submit, admin-only read) endpoints.",
  "feature_evidence.json": "Feature evidence report linking the Gallery section implementation (GallerySection component, Header/Footer nav links, App.tsx integration) to test ID REQ-1 with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated text file containing 1–2 sentence summaries of each frontend source file, describing component responsibilities and recent changes across the React app.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for the light and dark color themes used by shadcn/ui components throughout the app.",
  "frontend/index.html": "HTML entry point setting Hindi language, committee logo favicon, SEO meta description, and the Hindi page title for the Masjid-e-Gausia Welfare Committee site.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (including GallerySection between AnnouncementsSection and DonateSection) with GeometricDividers, wraps everything in a React Query provider, and conditionally renders the ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/AboutSection.tsx": "About section displaying four value cards (service, education, unity, honesty) and a mission panel with a Quranic quote; stat counters are currently set to zero.",
  "frontend/src/components/AnnouncementsSection.tsx": "Announcements section that fetches data via React Query and renders loading, error, empty, or a grid of announcement cards with Hindi-formatted dates and orange accents.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with mosque address/phone/email/hours info cards and a validated inquiry form that submits via the useSubmitInquiry hook.",
  "frontend/src/components/DecorativePattern.tsx": "A simple presentational component that overlays a geometric pattern image as an absolutely-positioned decorative background with configurable opacity.",
  "frontend/src/components/DonateSection.tsx": "Displays a donation section with copyable bank transfer details, impact statistics, and a Quranic quote, using DecorativePattern for background styling.",
  "frontend/src/components/Footer.tsx": "Site footer with logo/branding, quick navigation links with smooth scroll, contact info, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/GallerySection.tsx": "Photo gallery section displaying a 2026 annual event album in a grid with a keyboard-navigable lightbox for full-size image viewing.",
  "frontend/src/components/GeometricDivider.tsx": "A purely decorative component that renders a full-width section divider image with a max height of 80px.",
  "frontend/src/components/Header.tsx": "Fixed site header with logo, desktop/mobile navigation with smooth scroll, a donate button, and a LoginButton, with scroll-aware shadow styling.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section for the Masjid-e-Gausia Welfare Committee site, displaying a mosque background image, Bismillah text, logo, Hindi headings, and CTA buttons for donating and learning more with smooth scroll behavior.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout, showing loading state during authentication and clearing React Query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name and saves it as a user profile, blocking dismissal until the form is submitted.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of six welfare services (education, medical, housing, food, literacy campaign, widow support) offered by the committee, each with an icon, title, and description.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, using an authenticated identity when available or an anonymous actor otherwise, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthQueries.ts": "Provides React Query hooks for fetching and saving the caller's user profile, user role, and admin status via the ICP backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching announcements (sorted by date) and submitting contact inquiries via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Devanagari fonts, sets up Tailwind directives, defines a warm ivory/champagne/orange/near-black color palette via CSS custom properties, and provides reusable component utility classes like btn-primary, card-base, and section-heading.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a custom color palette (ivory, champagne, orange, gold, forest, near-black), Devanagari/Arabic font families, custom shadows, border radii mapped to CSS variables, and fade/accordion keyframe animations.",
  "project_state.json": "Project state metadata file tracking the current version, existing features, pending feature requests, and image requirements—specifically documenting the addition of a 'सालाना जलसा 2026' gallery album with four optimized event photos."
}