{
  "kind": "build_request",
  "title": "Apply Dhani (Dark Green) Color Theme to Website",
  "projectName": "Masjid-e-Gausia Welfare",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the website's color scheme to use dhani (a muted, earthy dark green, approximately #4a7c59 or similar olive-green tone) as the primary brand color throughout the site. Replace the current primary/forest green color tokens in the CSS custom properties and Tailwind config with the dhani color. Apply consistently to the header background, hero section accents, section headings, buttons, dividers, card borders, and any other elements currently using the primary green color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "वेबसाइट को धानी कलर करे"
        ]
      },
      "acceptanceCriteria": [
        "The header/navbar background uses the dhani color (#4a7c59 or closest equivalent earthy olive-green).",
        "Primary buttons (CTA buttons in HeroSection, DonateSection, ContactSection) use the dhani color as their background.",
        "Section headings and decorative accents across all sections (About, Services, Announcements, Donate, Contact) reflect the dhani color.",
        "The Tailwind config and CSS custom properties (--color-forest or equivalent) are updated to the dhani value.",
        "The overall color feel is cohesive and consistent — no components are left with the old primary green."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui.",
    "Do not change any Hindi-language text content on the website.",
    "Do not alter the layout or structure of any section — only color values should change."
  ],
  "nonGoals": [
    "Redesigning the layout or typography.",
    "Adding new sections or features.",
    "Changing the gold/cream accent colors unless needed for contrast with the new dhani primary.",
    "Backend changes of any kind."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}