{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix gallery lightbox and add location text",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the photo lightbox in GallerySection so clicking any photo correctly opens and displays the full-size image with proper navigation",
      "acceptanceCriteria": [
        "Clicking any photo thumbnail in the Saalana Jalsa 2026 gallery opens a lightbox overlay displaying the full-size image",
        "The lightbox can be closed by clicking outside or pressing Escape",
        "Keyboard navigation (left/right arrows) between photos works correctly in the lightbox",
        "No broken image or blank overlay appears when a photo is clicked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GallerySection.tsx",
          "operation": "modify",
          "description": "Fix the lightbox functionality by ensuring the selectedImage state is properly set when a photo is clicked, the image src uses the correct workspace path (frontend/public/assets/<filename>), the modal overlay renders the full-size image, and keyboard event handlers for Escape and arrow keys work correctly. Verify that all four Saalana Jalsa photos (IMG-20260216-WA0033.jpg, IMG_20260215_145426.jpg, IMG_20260215_154805.jpg, IMG_20260215_164503.jpg) are accessible and display properly when clicked."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Append 'Maharajganj Jainpur' after all instances of 'Masjid-e-Gausia Welfare Committee' across the site",
      "acceptanceCriteria": [
        "Every visible instance of 'Masjid-e-Gausia Welfare Committee' on the page is followed by 'Maharajganj Jainpur'",
        "The page title in index.html also reflects the updated name",
        "The layout accommodates the longer text without overflow or wrapping issues"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update the main heading text from 'मस्जिद ए गौसिया वेलफेयर कमिटी' to 'मस्जिद ए गौसिया वेलफेयर कमिटी महराजगंज जैनपुर' and update the English subtitle 'Masjid-e-Gausia Welfare Committee' to 'Masjid-e-Gausia Welfare Committee Maharajganj Jainpur'. Ensure the layout accommodates the longer text without overflow."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the organization name text from 'Masjid-e-Gausia Welfare Committee' to 'Masjid-e-Gausia Welfare Committee Maharajganj Jainpur' in both desktop and mobile navigation views. Adjust responsive styling if needed to prevent text overflow on smaller screens."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the organization name from 'मस्जिद ए गौसिया वेलफेयर कमिटी' to 'मस्जिद ए गौसिया वेलफेयर कमिटी महराजगंज जैनपुर' and the copyright text from 'Masjid-e-Gausia Welfare Committee' to 'Masjid-e-Gausia Welfare Committee Maharajganj Jainpur'. Ensure the footer layout handles the longer text gracefully."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the page title from 'मस्जिद ए गौसिया वेलफेयर कमिटी' to 'मस्जिद ए गौसिया वेलफेयर कमिटी महराजगंज जैनपुर' and update the meta description to include 'Maharajganj Jainpur' after 'Masjid-e-Gausia Welfare Committee'."
        }
      ]
    }
  ]
}